{"artists":[{"idArtist":"126472","strArtist":"蔡琴","strArtistStripped":null,"strArtistAlternate":"","strLabel":null,"idLabel":null,"intFormedYear":null,"intBornYear":null,"intDiedYear":null,"strDisbanded":null,"strStyle":"","strGenre":"","strMood":"","strWebsite":"","strFacebook":"","strTwitter":"1","strBiographyEN":"Tsai Chin (Chinese: 蔡琴; pinyin: Cài Qín; Minnan: Chhoà Khîm) is a pop and folk singer from Taiwan (her ancestral home is in Hubei). She sings in both Mandarin Chinese and Taiwanese (Min Nan) and is known for her naturally magnetic rich vocals and witty persona. Her well-known hits include 《被遺忘的時光》、《恰似你的溫柔》、《最後一夜》、《讀你》、《你的眼神》 and more. The peak of her popularity in Taiwan was from the late 1970s to the mid-1990s but she remains popular in mainland China.  Taiwan songstress Tsai Chin is an unquestionably enduring force on the music scene, after achieving her earliest hits in the late 70s, scoring unparalleled fame in the 80s, and having her voice dominate much of the Chinese radio airwaves throughout the 80s and a good half of the 90s.   Even today, at the age of 49, Tsai Chin is never quite out of sight of her fans with all her ongoing concerts and musicals. Today, Our reporter Xiaohua reveals the amazing career of music legend Tsai Chin.  It's not easy to describe just how popular Tsai Chin has been with mere words, so perhaps the best proof comes from a classic scene in the Hong Kong movie \"The Infernal Affairs \", in which two opponents meet in a music shop and sit down shoulder to shoulder to appreciate the songs of Tsai Chin. One of the two makes a comment something like this: \"Her soprano tenor is sweet, while the alto is accurate, and the contralto bass is deep. In a word, it's transparent.\" This sums up the opinions of most fans really well. Her thick, natural, magnetic voice and captivating persona give Tsai Chin enduring charm.   The track you've been listening to is one of Tsai Chin's older hits called \"The Forgotten Time\". The song features Tsai Chin singing solo, her comfortable mezzo-soprano vocals featured, with barely any musical accompaniment at the opening. As its name suggests, the song aims to call back deeply buried memories within people's hearts, be they sweet or bitter. Tsai Chin's voice evokes soft melodies and deep emotions, already enough to ripple the serene surface of ones soul like a gentle breeze, even without the help of lyrics.  Tsai Chin's legend began with a singing competition during her first year in college. At that time, singing Taiwan school ballads with a guitar was very popular. Through that competition, she found her favorite guitar and started on her successful music career. She reached her prime in the 80s, picking up numerous music awards from Taiwan and Hong Kong touring across Asia, Europe and the USA. Tsai has released 41 albums all told and is widely popular throughout the Chinese world. One saying goes \"Wherever there are Chinese, you will find Tsai Chin.\"   \"Just like Your Tenderness\" is the song that won Tsai Chin thundering fame in 1980. It was composed by late Taiwan musician, Liang Hongzhi, who passed away twenty years after writing the legendary hit. After all her ups and downs, Tsai has now really achieved a better understanding of the song:   \"Actually, it's not a melancholy song. What it tells of is a kind of loneliness. Now after I've gone through many ups and downs in life, I understand the loneliness of the composer even better. Imagine his loneliness. He compares himself to an isolated island with no one around, where only the tender hand of the waves brings him comfort.\"   Now with that explanation in mind, let's have a listen to this ever popular number, which is still the most requested song wherever Tsai Chin appears.   Although she's had a singing career spanning almost three decades, she's still not perceived as being out of date. She grows with time the way wine gets better with age---and she's forever the favorite of music aficionados. Now after going through all the joys and sorrows of life, Tsai Chin's songs seem to have an even richer emotional quality. The warmth in her songs aims directly at the very soft corners of the heart, making a direct hit. The last song we're going to play for you is entitled \"Ferry Crossing\". The intensely poetic lyrics, written by famous Taiwan poet Xi Murong, go like this: \"Let us shake hands one last time, then I will withdraw my hand. There's not even a wild flower at the ferry crossing to give as a parting gift, so that we can only stare at each other. Take my blessings on the front of your gown. Tomorrow you'll be at the other end of the world.\" The song is a beautiful showcase of Tsai Chin's full-throated and rich voice, filled with nuance and emotion.   Trivia : In one scene of the 2002 hit Hong Kong thriller movie Infernal Affairs, two rivals meet in a music shop and sit to appreciate the music of Tsai Chin.  She was once married to Taiwanese Director Edward Yang.","strBiographyDE":null,"strBiographyFR":null,"strBiographyCN":null,"strBiographyIT":null,"strBiographyJP":null,"strBiographyRU":null,"strBiographyES":null,"strBiographyPT":null,"strBiographySE":null,"strBiographyNL":null,"strBiographyHU":null,"strBiographyNO":null,"strBiographyIL":null,"strBiographyPL":null,"strGender":"Female","intMembers":"1","strCountry":"","strCountryCode":"TW","strArtistThumb":"https://www.theaudiodb.com/images/media/artist/thumb/yqypux1389374255.jpg","strArtistLogo":null,"strArtistCutout":null,"strArtistClearart":null,"strArtistWideThumb":null,"strArtistFanart":null,"strArtistFanart2":null,"strArtistFanart3":null,"strArtistFanart4":null,"strArtistBanner":null,"strMusicBrainzID":"099ea308-febe-4387-8fb8-004e81e15d76","strISNIcode":null,"strLastFMChart":null,"intCharted":"4","strLocked":"unlocked"}]}